:description: Commit a transaction.

[[http-api-commit-an-open-transaction]]
= Commit a transaction

When you have executed all the statements for the transaction, and want to commit the changes to the database, you can use `POST db/\{name}/tx/\{txid}/commit`, which can also include any final statements to execute before committing.

_Example request_

* *+POST+*  +http://localhost:7474/db/neo4j/tx/2/commit+
* *+Accept:+* +application/json;charset=UTF-8+
* *+Content-Type:+* +application/json+

[source, JSON, role="nocopy"]
----
{
  "statements": [
    {
      "statement": "MATCH (n) WHERE id(n) = $nodeId RETURN n",
      "parameters": {
        "nodeId": 6
      }
    }
  ]
}
----

_Example response_

* *+200:+* +OK+
* *+Content-Type:+* +application/json;charset=utf-8+

[source, JSON, role="nocopy"]
----
{
  "results" : [ {
    "columns" : [ "n" ],
    "data" : [ {
      "row" : [ { } ],
      "meta" : [ {
        "id" : 6,
        "type" : "node",
        "deleted" : false
      } ]
    } ]
  } ],
  "errors" : [ ]
}
----

