:description: Legacy endpoints.

[[http-api-legacy-endpoints]]
= [deprecated]#Legacy Endpoints#

[IMPORTANT]
====
The API described in this section of the manual has been deprecated and will be removed in Neo4j 5.0.
====

For backwards compatibility with neo4j 3.5, it is still possible to use the HTTP API without specifying the database in the URL.
For example:

`http://localhost:7474/db/data/transaction/commit`.

Since the database is not specified, the statements will be executed against the user's _global default database_.

All endpoints can also be executed against the legacy API, where `db/<database-name>` is replaced with `db/data/transaction`.
The input format and output format are identical for both the legacy API and the current API.

For example, beginning and committing a transaction in a single requests looks as follows:

_Example request_

* *+POST+* +http://localhost:7474/db/data/transaction/commit+
* *+Accept:+* +application/json;charset=UTF-8+
* *+Content-Type:+* +application/json+

[source, JSON, role="nocopy"]
----
{
  "statements": [
    {
      "statement": "MATCH (n) WHERE id(n) = $nodeId RETURN n",
      "parameters": {
        "nodeId": 2
      }
    }
  ]
}
----

_Example response_

* *+200:+* +OK+
* *+Content-Type:+* +application/json;charset=utf-8+

[source, JSON, role="nocopy"]
----
{
  "results" : [ {
    "columns" : [ "n" ],
    "data" : [ {
      "row" : [ { } ],
      "meta" : [ {
        "id" : 2,
        "type" : "node",
        "deleted" : false
      } ]
    } ]
  } ],
  "errors" : [ ]
}
----
